import { type SidoData } from "./regions";

export const chinaRegions: SidoData[] = [
  {
    "name": "北京市",
    "shortName": "北京",
    "gunguList": [
      {
        "name": "朝阳区",
        "dongs": [
          "三里屯街道",
          "望京街道",
          "朝外街道",
          "呼家楼街道",
          "建外街道",
          "酒仙桥街道",
          "亚运村街道",
          "奥运村街道",
          "潘家园街道"
        ]
      },
      {
        "name": "海淀区",
        "dongs": [
          "中关村街道",
          "学院路街道",
          "清华园街道",
          "燕园街道",
          "上地街道",
          "海淀街道",
          "万寿路街道",
          "紫竹院街道"
        ]
      },
      {
        "name": "西城区",
        "dongs": [
          "金融街街道",
          "西长安街街道",
          "什刹海街道",
          "月坛街道",
          "展览路街道",
          "德胜街道",
          "大栅栏街道"
        ]
      },
      {
        "name": "东城区",
        "dongs": [
          "东华门街道",
          "王府井街道",
          "安定门街道",
          "东直门街道",
          "北新桥街道",
          "景山街道",
          "建国门街道"
        ]
      },
      {
        "name": "丰台区",
        "dongs": [
          "丰台街道",
          "右安门街道",
          "太平桥街道",
          "方庄街道",
          "花乡街道",
          "卢沟桥街道"
        ]
      },
      {
        "name": "石景山区",
        "dongs": [
          "八角街道",
          "古城街道",
          "苹果园街道",
          "老山街道",
          "鲁谷街道"
        ]
      },
      {
        "name": "昌平区",
        "dongs": [
          "城北街道",
          "城南街道",
          "天通苑北街道",
          "天通苑南街道",
          "回龙观街道",
          "龙泽园街道"
        ]
      },
      {
        "name": "大兴区",
        "dongs": [
          "兴丰街道",
          "林校路街道",
          "清源街道",
          "荣华街道(亦庄)",
          "博兴街道"
        ]
      },
      {
        "name": "通州区",
        "dongs": [
          "北苑街道",
          "中仓街道",
          "玉桥街道",
          "梨园镇",
          "宋庄镇"
        ]
      },
      {
        "name": "顺义区",
        "dongs": [
          "光明街道",
          "胜利街道",
          "空港街道(首都机场)",
          "天竺镇"
        ]
      }
    ]
  },
  {
    "name": "上海市",
    "shortName": "上海",
    "gunguList": [
      {
        "name": "浦东新区",
        "dongs": [
          "陆家嘴街道",
          "张江镇",
          "金桥镇",
          "花木街道",
          "世博地区",
          "川沙新镇",
          "三林镇",
          "碧云国际社区"
        ]
      },
      {
        "name": "黄浦区",
        "dongs": [
          "外滩街道",
          "南京东路街道",
          "淮海中路街道",
          "豫园街道",
          "打浦桥街道",
          "新天地"
        ]
      },
      {
        "name": "静安区",
        "dongs": [
          "南京西路街道",
          "静安寺街道",
          "江宁路街道",
          "曹家渡街道",
          "大宁路街道"
        ]
      },
      {
        "name": "徐汇区",
        "dongs": [
          "徐家汇街道",
          "湖南路街道",
          "天平路街道",
          "斜土路街道",
          "虹梅路街道(漕河泾)"
        ]
      },
      {
        "name": "长宁区",
        "dongs": [
          "古北新区",
          "虹桥街道",
          "华阳路街道",
          "江苏路街道",
          "新华路街道",
          "周家桥街道"
        ]
      },
      {
        "name": "闵行区",
        "dongs": [
          "虹桥镇(韩国街/古北南)",
          "七宝镇",
          "莘庄镇",
          "梅陇镇",
          "华漕镇"
        ]
      },
      {
        "name": "杨浦区",
        "dongs": [
          "五角场街道",
          "控江路街道",
          "定海路街道",
          "长白新村街道"
        ]
      },
      {
        "name": "普陀区",
        "dongs": [
          "真如镇街道",
          "长寿路街道",
          "曹杨新村街道",
          "长风新村街道"
        ]
      },
      {
        "name": "虹口区",
        "dongs": [
          "四川北路街道",
          "北外滩街道",
          "曲阳路街道",
          "广中路街道"
        ]
      },
      {
        "name": "松江区",
        "dongs": [
          "岳阳街道",
          "永丰街道",
          "方松街道",
          "九亭镇",
          "泗泾镇"
        ]
      }
    ]
  },
  {
    "name": "广东省",
    "shortName": "广东",
    "gunguList": [
      {
        "name": "广州市",
        "dongs": [
          "天河区",
          "越秀区",
          "海珠区",
          "荔湾区",
          "白云区",
          "番禺区",
          "黄埔区",
          "花都区"
        ]
      },
      {
        "name": "深圳市",
        "dongs": [
          "南山区(科技园)",
          "福田区(CBD)",
          "罗湖区",
          "宝安区",
          "龙岗区",
          "龙华区",
          "盐田区",
          "坪山区"
        ]
      },
      {
        "name": "珠海市",
        "dongs": [
          "香洲区",
          "金湾区",
          "斗门区",
          "横琴粤澳深度合作区"
        ]
      },
      {
        "name": "佛山市",
        "dongs": [
          "禅城区",
          "南海区",
          "顺德区",
          "三水区",
          "高明区"
        ]
      },
      {
        "name": "东莞市",
        "dongs": [
          "南城街道",
          "东城街道",
          "莞城街道",
          "万江街道",
          "长安镇",
          "虎门镇",
          "松山湖"
        ]
      },
      {
        "name": "惠州市",
        "dongs": [
          "惠城区",
          "惠阳区",
          "博罗县",
          "大亚湾经济技术开发区"
        ]
      },
      {
        "name": "中山市",
        "dongs": [
          "石岐街道",
          "东区街道",
          "西区街道",
          "南区街道",
          "火炬开发区",
          "小榄镇"
        ]
      }
    ]
  },
  {
    "name": "吉林省",
    "shortName": "吉林",
    "gunguList": [
      {
        "name": "延边朝鲜族自治州",
        "dongs": [
          "延吉市",
          "图们市",
          "敦化市",
          "珲春市",
          "龙井市",
          "和龙市",
          "汪清县",
          "安图县"
        ]
      },
      {
        "name": "长春市",
        "dongs": [
          "朝阳区",
          "南关区",
          "宽城区",
          "二道区",
          "绿园区",
          "双阳区",
          "九台区"
        ]
      },
      {
        "name": "吉林市",
        "dongs": [
          "船营区",
          "昌邑区",
          "龙潭区",
          "丰满区",
          "永吉县"
        ]
      },
      {
        "name": "通化市",
        "dongs": [
          "东昌区",
          "二道江区",
          "集安市",
          "通化县"
        ]
      },
      {
        "name": "白山市",
        "dongs": [
          "浑江区",
          "江源区",
          "临江市",
          "抚松县(长白山)"
        ]
      }
    ]
  },
  {
    "name": "辽宁省",
    "shortName": "辽宁",
    "gunguList": [
      {
        "name": "沈阳市",
        "dongs": [
          "和平区(西塔韩国街)",
          "沈河区",
          "大东区",
          "皇姑区",
          "铁西区",
          "浑南区",
          "于洪区"
        ]
      },
      {
        "name": "大连市",
        "dongs": [
          "中山区",
          "西岗区",
          "沙河口区",
          "甘井子区",
          "旅顺口区",
          "金州区(金普新区)"
        ]
      },
      {
        "name": "丹东市",
        "dongs": [
          "振兴区",
          "元宝区",
          "振安区",
          "东港市",
          "凤城市"
        ]
      },
      {
        "name": "鞍山市",
        "dongs": [
          "铁东区",
          "铁西区",
          "立山区",
          "千山区",
          "海城市"
        ]
      }
    ]
  },
  {
    "name": "黑龙江省",
    "shortName": "黑龙江",
    "gunguList": [
      {
        "name": "哈尔滨市",
        "dongs": [
          "道里区(中央大街)",
          "南岗区",
          "道外区",
          "平房区",
          "松北区",
          "香坊区"
        ]
      },
      {
        "name": "牡丹江市",
        "dongs": [
          "东安区",
          "阳明区",
          "爱民区",
          "西安区",
          "绥芬河市",
          "海林市"
        ]
      },
      {
        "name": "齐齐哈尔市",
        "dongs": [
          "建华区",
          "龙沙区",
          "铁锋区",
          "昂昂溪区"
        ]
      },
      {
        "name": "大庆市",
        "dongs": [
          "萨尔图区",
          "让胡路区",
          "龙凤区",
          "红岗区"
        ]
      }
    ]
  },
  {
    "name": "山东省",
    "shortName": "山东",
    "gunguList": [
      {
        "name": "青岛市",
        "dongs": [
          "市南区",
          "市北区",
          "李沧区",
          "崂山区",
          "城阳区(韩企韩侨集中区)",
          "西海岸新区(黄岛)"
        ]
      },
      {
        "name": "济南市",
        "dongs": [
          "历下区",
          "市中区",
          "槐荫区",
          "天桥区",
          "历城区",
          "高新区"
        ]
      },
      {
        "name": "烟台市",
        "dongs": [
          "芝罘区",
          "福山区",
          "莱山区",
          "牟平区",
          "开发区"
        ]
      },
      {
        "name": "威海市",
        "dongs": [
          "环翠区",
          "文登区",
          "荣成市",
          "乳山市"
        ]
      },
      {
        "name": "潍坊市",
        "dongs": [
          "奎文区",
          "潍城区",
          "坊子区",
          "寒亭区",
          "寿光市"
        ]
      }
    ]
  },
  {
    "name": "江苏省",
    "shortName": "江苏",
    "gunguList": [
      {
        "name": "苏州市",
        "dongs": [
          "姑苏区",
          "虎丘区(高新区)",
          "吴中区",
          "相城区",
          "吴江区",
          "昆山市",
          "常熟市",
          "张家港市",
          "工业园区"
        ]
      },
      {
        "name": "南京市",
        "dongs": [
          "玄武区",
          "秦淮区",
          "建邺区",
          "鼓楼区",
          "浦口区",
          "栖霞区",
          "雨花台区",
          "江宁区"
        ]
      },
      {
        "name": "无锡市",
        "dongs": [
          "梁溪区",
          "锡山区",
          "惠山区",
          "滨湖区",
          "新吴区(高新区)",
          "江阴市",
          "宜兴市"
        ]
      },
      {
        "name": "常州市",
        "dongs": [
          "天宁区",
          "钟楼区",
          "新北区",
          "武进区",
          "金坛区"
        ]
      }
    ]
  },
  {
    "name": "浙江省",
    "shortName": "浙江",
    "gunguList": [
      {
        "name": "杭州市",
        "dongs": [
          "上城区",
          "拱墅区",
          "西湖区",
          "滨江区",
          "萧山区",
          "余杭区",
          "临平区",
          "钱塘区"
        ]
      },
      {
        "name": "宁波市",
        "dongs": [
          "海曙区",
          "江北区",
          "镇海区",
          "北仑区",
          "鄞州区",
          "奉化区",
          "慈溪市",
          "余姚市"
        ]
      },
      {
        "name": "温州市",
        "dongs": [
          "鹿城区",
          "龙湾区",
          "瓯海区",
          "洞头区",
          "瑞安市",
          "乐清市"
        ]
      },
      {
        "name": "义乌市(金华)",
        "dongs": [
          "稠城街道",
          "北苑街道",
          "稠江街道",
          "江东街道",
          "后宅街道",
          "国际商贸城"
        ]
      }
    ]
  },
  {
    "name": "四川省",
    "shortName": "四川",
    "gunguList": [
      {
        "name": "成都市",
        "dongs": [
          "锦江区",
          "青羊区",
          "金牛区",
          "武侯区",
          "成华区",
          "龙泉驿区",
          "双流区",
          "高新区",
          "天府新区"
        ]
      },
      {
        "name": "绵阳市",
        "dongs": [
          "涪城区",
          "游仙区",
          "安州区",
          "江油市"
        ]
      }
    ]
  },
  {
    "name": "湖北省",
    "shortName": "湖北",
    "gunguList": [
      {
        "name": "武汉市",
        "dongs": [
          "江岸区",
          "江汉区",
          "硚口区",
          "汉阳区",
          "武昌区",
          "青山區",
          "洪山区",
          "东西湖区",
          "光谷"
        ]
      }
    ]
  },
  {
    "name": "天津市",
    "shortName": "天津",
    "gunguList": [
      {
        "name": "滨海新区",
        "dongs": [
          "塘沽街道",
          "杭州道街道",
          "泰达街道(开发区)",
          "中新生态城"
        ]
      },
      {
        "name": "和平区",
        "dongs": [
          "劝业场街道",
          "小白楼街道",
          "体育馆街道",
          "新兴街道",
          "南营门街道"
        ]
      },
      {
        "name": "南开区",
        "dongs": [
          "兴南街道",
          "广开街道",
          "学府街道",
          "万兴街道",
          "水上公园街道"
        ]
      },
      {
        "name": "西青区",
        "dongs": [
          "杨柳青镇",
          "中北镇",
          "西营门街道",
          "大寺镇"
        ]
      }
    ]
  },
  {
    "name": "重庆市",
    "shortName": "重庆",
    "gunguList": [
      {
        "name": "渝中区",
        "dongs": [
          "解放碑街道",
          "朝天门街道",
          "大溪沟街道",
          "两路口街道",
          "石油路街道"
        ]
      },
      {
        "name": "江北区",
        "dongs": [
          "观音桥街道",
          "华新街街道",
          "五里店街道",
          "寸滩街道",
          "大石坝街道"
        ]
      },
      {
        "name": "渝北区",
        "dongs": [
          "双龙湖街道",
          "龙溪街道",
          "龙山街道",
          "两路街道",
          "仙桃街道(中央公园)"
        ]
      }
    ]
  },
  {
    "name": "陕西省",
    "shortName": "陕西",
    "gunguList": [
      {
        "name": "西安市",
        "dongs": [
          "新城区",
          "碑林区",
          "莲湖区",
          "雁塔区(小寨)",
          "未央区",
          "高新区(三星半导体)",
          "长安区"
        ]
      }
    ]
  },
  {
    "name": "福建省",
    "shortName": "福建",
    "gunguList": [
      {
        "name": "厦门市",
        "dongs": [
          "思明区",
          "湖里区",
          "集美区",
          "海沧区",
          "同安区",
          "翔安区"
        ]
      },
      {
        "name": "福州市",
        "dongs": [
          "鼓楼区",
          "台江区",
          "仓山区",
          "晋安区",
          "马尾区",
          "长乐区"
        ]
      }
    ]
  },
  {
    "name": "湖南省",
    "shortName": "湖南",
    "gunguList": [
      {
        "name": "长沙市",
        "dongs": [
          "芙蓉区",
          "天心区",
          "岳麓区",
          "开福区",
          "雨花区",
          "望城区",
          "长沙县"
        ]
      }
    ]
  },
  {
    "name": "河南省",
    "shortName": "河南",
    "gunguList": [
      {
        "name": "郑州市",
        "dongs": [
          "金水区",
          "二七区",
          "中原区",
          "管城回族区",
          "郑东新区",
          "航空港区(富士康)"
        ]
      }
    ]
  },
  {
    "name": "河北省",
    "shortName": "河北",
    "gunguList": [
      {
        "name": "石家庄市",
        "dongs": [
          "长安区",
          "桥西区",
          "新华区",
          "裕华区",
          "藁城区",
          "鹿泉区"
        ]
      },
      {
        "name": "雄安新区",
        "dongs": [
          "容城县",
          "安新县",
          "雄县",
          "容东片区",
          "启动区"
        ]
      }
    ]
  },
  {
    "name": "云南省",
    "shortName": "云南",
    "gunguList": [
      {
        "name": "昆明市",
        "dongs": [
          "五华区",
          "盘龙区",
          "官渡区",
          "西山区",
          "呈贡区"
        ]
      }
    ]
  },
  {
    "name": "海南省",
    "shortName": "海南",
    "gunguList": [
      {
        "name": "海口市",
        "dongs": [
          "美兰区",
          "龙华区",
          "琼山区",
          "秀英区"
        ]
      },
      {
        "name": "三亚市",
        "dongs": [
          "吉阳区",
          "天涯区",
          "海棠区(亚龙湾)",
          "崖州区"
        ]
      }
    ]
  },
  {
    "name": "香港特别行政区",
    "shortName": "香港",
    "gunguList": [
      {
        "name": "中西区",
        "dongs": [
          "中环",
          "金钟",
          "西营盘",
          "坚尼地城",
          "半山区"
        ]
      },
      {
        "name": "湾仔区",
        "dongs": [
          "铜锣湾",
          "湾仔",
          "跑马地",
          "大坑"
        ]
      },
      {
        "name": "油尖旺区",
        "dongs": [
          "尖沙咀",
          "旺角",
          "油麻地",
          "大角咀"
        ]
      },
      {
        "name": "九龙城区",
        "dongs": [
          "红磡",
          "土瓜湾",
          "九龙塘",
          "启德"
        ]
      }
    ]
  },
  {
    "name": "澳门特别行政区",
    "shortName": "澳门",
    "gunguList": [
      {
        "name": "大堂区",
        "dongs": [
          "新口岸",
          "南湾",
          "水坑尾",
          "塞哥维亚街"
        ]
      },
      {
        "name": "望德堂区",
        "dongs": [
          "荷兰园",
          "塔石",
          "东望洋山"
        ]
      },
      {
        "name": "嘉模堂区(氹仔)",
        "dongs": [
          "氹仔旧城区",
          "威尼斯人度假区",
          "大学区"
        ]
      }
    ]
  }
];
