import { type SidoData } from "./regions";

export const japanRegions: SidoData[] = [
  {
    "name": "東京都",
    "shortName": "東京",
    "gunguList": [
      {
        "name": "新宿区",
        "dongs": [
          "歌舞伎町",
          "西新宿",
          "新宿",
          "大久保",
          "高田馬場",
          "四谷",
          "神楽坂",
          "百人町",
          "信濃町",
          "若松町",
          "市谷"
        ]
      },
      {
        "name": "渋谷区",
        "dongs": [
          "道玄坂",
          "宇田川町",
          "神南",
          "恵比寿",
          "広尾",
          "代官山町",
          "神宮前",
          "原宿",
          "笹塚",
          "初台",
          "代々木"
        ]
      },
      {
        "name": "港区",
        "dongs": [
          "六本木",
          "赤坂",
          "麻布十番",
          "南青山",
          "北青山",
          "白金",
          "新橋",
          "虎ノ門",
          "芝公園",
          "芝浦",
          "お台場"
        ]
      },
      {
        "name": "千代田区",
        "dongs": [
          "丸の内",
          "大手町",
          "有楽町",
          "霞が関",
          "永田町",
          "秋葉原",
          "外神田",
          "麹町",
          "九段北",
          "神田神保町"
        ]
      },
      {
        "name": "中央区",
        "dongs": [
          "銀座",
          "日本橋",
          "八重洲",
          "京橋",
          "築地",
          "月島",
          "勝どき",
          "晴海",
          "明石町",
          "人形町"
        ]
      },
      {
        "name": "豊島区",
        "dongs": [
          "東池袋",
          "西池袋",
          "南池袋",
          "目白",
          "巣鴨",
          "駒込",
          "南大塚",
          "北大塚"
        ]
      },
      {
        "name": "文京区",
        "dongs": [
          "本郷",
          "湯島",
          "小石川",
          "後楽",
          "目白台",
          "千駄木",
          "根津",
          "白山"
        ]
      },
      {
        "name": "台東区",
        "dongs": [
          "上野",
          "浅草",
          "浅草橋",
          "谷中",
          "蔵前",
          "鳥越",
          "柳橋",
          "雷門"
        ]
      },
      {
        "name": "墨田区",
        "dongs": [
          "押上",
          "錦糸",
          "太平",
          "両国",
          "向島",
          "吾妻橋",
          "八広"
        ]
      },
      {
        "name": "江東区",
        "dongs": [
          "豊洲",
          "有明",
          "東雲",
          "木場",
          "門前仲町",
          "清澄",
          "亀戸"
        ]
      },
      {
        "name": "品川区",
        "dongs": [
          "大崎",
          "大井",
          "東品川",
          "西五反田",
          "東五反田",
          "旗の台",
          "戸越"
        ]
      },
      {
        "name": "目黒区",
        "dongs": [
          "中目黒",
          "目黒",
          "自由が丘",
          "祐天寺",
          "青葉台",
          "下目黒"
        ]
      },
      {
        "name": "大田区",
        "dongs": [
          "蒲田",
          "羽田",
          "大森北",
          "田園調布",
          "西蒲田",
          "池上"
        ]
      },
      {
        "name": "世田谷区",
        "dongs": [
          "三軒茶屋",
          "下北沢",
          "二子玉川",
          "成城",
          "豪徳寺",
          "経堂",
          "桜新町"
        ]
      },
      {
        "name": "中野区",
        "dongs": [
          "中野",
          "東中野",
          "新井",
          "野方",
          "沼袋",
          "鷺宮"
        ]
      },
      {
        "name": "杉並区",
        "dongs": [
          "荻窪",
          "阿佐谷南",
          "高円寺北",
          "高円寺南",
          "西荻北",
          "浜田山"
        ]
      },
      {
        "name": "北区",
        "dongs": [
          "赤羽",
          "王子",
          "十条",
          "田端",
          "滝野川"
        ]
      },
      {
        "name": "荒川区",
        "dongs": [
          "西日暮里",
          "東日暮里",
          "町屋",
          "南千住",
          "荒川"
        ]
      },
      {
        "name": "板橋区",
        "dongs": [
          "板橋",
          "成増",
          "高島平",
          "大山町",
          "常盤台"
        ]
      },
      {
        "name": "練馬区",
        "dongs": [
          "練馬",
          "光が丘",
          "石神井町",
          "大泉学園町"
        ]
      },
      {
        "name": "足立区",
        "dongs": [
          "千住",
          "綾瀬",
          "竹の塚",
          "西新井",
          "梅島"
        ]
      },
      {
        "name": "葛飾区",
        "dongs": [
          "亀有",
          "柴又",
          "新小岩",
          "金町",
          "立石"
        ]
      },
      {
        "name": "江戸川区",
        "dongs": [
          "船堀",
          "葛西",
          "西葛西",
          "小岩",
          "一之江"
        ]
      },
      {
        "name": "八王子市",
        "dongs": [
          "旭町",
          "明神町",
          "三崎町",
          "中野町",
          "南大沢"
        ]
      },
      {
        "name": "武蔵野市",
        "dongs": [
          "吉祥寺本町",
          "吉祥寺南町",
          "中町",
          "境"
        ]
      },
      {
        "name": "町田市",
        "dongs": [
          "原町田",
          "中町",
          "森野",
          "玉川学園"
        ]
      },
      {
        "name": "立川市",
        "dongs": [
          "曙町",
          "柴崎町",
          "錦町",
          "高松町"
        ]
      },
      {
        "name": "調布市",
        "dongs": [
          "小島町",
          "布田",
          "仙川町",
          "深大寺"
        ]
      }
    ]
  },
  {
    "name": "大阪府",
    "shortName": "大阪",
    "gunguList": [
      {
        "name": "大阪市 中央区",
        "dongs": [
          "心斎橋筋",
          "難波",
          "道頓堀",
          "本町",
          "北浜",
          "日本橋",
          "宗右衛門町",
          "谷町"
        ]
      },
      {
        "name": "大阪市 北区",
        "dongs": [
          "梅田",
          "中之島",
          "天神橋",
          "堂島",
          "曽根崎",
          "茶屋町",
          "扇町"
        ]
      },
      {
        "name": "大阪市 浪速区",
        "dongs": [
          "難波中",
          "恵美須東",
          "日本橋西",
          "湊町",
          "大国"
        ]
      },
      {
        "name": "大阪市 西区",
        "dongs": [
          "北堀江",
          "南堀江",
          "靱本町",
          "新町",
          "江戸堀"
        ]
      },
      {
        "name": "大阪市 天王寺区",
        "dongs": [
          "上本町",
          "逢阪",
          "堀越町",
          "四天王寺",
          "玉造"
        ]
      },
      {
        "name": "大阪市 淀川区",
        "dongs": [
          "西中島",
          "十三本町",
          "新大阪",
          "宮原",
          "塚本"
        ]
      },
      {
        "name": "大阪市 阿倍野区",
        "dongs": [
          "阿倍野筋",
          "松崎町",
          "西田辺町",
          "昭和町"
        ]
      },
      {
        "name": "堺市",
        "dongs": [
          "堺区",
          "中区",
          "東区",
          "西区",
          "南区",
          "北区",
          "美原区"
        ]
      },
      {
        "name": "東大阪市",
        "dongs": [
          "荒本北",
          "長堂",
          "足代",
          "小阪",
          "花園"
        ]
      },
      {
        "name": "豊中市",
        "dongs": [
          "蛍池",
          "千里中央",
          "岡町",
          "服部"
        ]
      },
      {
        "name": "吹田市",
        "dongs": [
          "江坂町",
          "千里万博公園",
          "垂水町",
          "岸部"
        ]
      },
      {
        "name": "枚方市",
        "dongs": [
          "岡東町",
          "楠葉",
          "香里園",
          "宮之阪"
        ]
      }
    ]
  },
  {
    "name": "京都府",
    "shortName": "京都",
    "gunguList": [
      {
        "name": "京都市 中京区",
        "dongs": [
          "河原町",
          "烏丸",
          "錦小路",
          "寺町",
          "先斗町",
          "二条"
        ]
      },
      {
        "name": "京都市 下京区",
        "dongs": [
          "京都駅前",
          "四条通",
          "烏丸通",
          "五条通",
          "七条通"
        ]
      },
      {
        "name": "京都市 東山区",
        "dongs": [
          "祇園町",
          "清水",
          "八坂",
          "三条",
          "五条"
        ]
      },
      {
        "name": "京都市 左京区",
        "dongs": [
          "岡崎",
          "銀閣寺",
          "一乗寺",
          "吉田",
          "修学院"
        ]
      },
      {
        "name": "京都市 右京区",
        "dongs": [
          "嵐山",
          "太秦",
          "西院",
          "西京極",
          "花園"
        ]
      },
      {
        "name": "京都市 北区",
        "dongs": [
          "金閣寺",
          "上賀茂",
          "紫野",
          "平野",
          "小山"
        ]
      },
      {
        "name": "宇治市",
        "dongs": [
          "宇治",
          "小倉町",
          "木幡",
          "六地蔵"
        ]
      }
    ]
  },
  {
    "name": "神奈川県",
    "shortName": "神奈川",
    "gunguList": [
      {
        "name": "横浜市 中区",
        "dongs": [
          "元町",
          "山下町",
          "みなとみらい",
          "日本大通",
          "本町",
          "中華街"
        ]
      },
      {
        "name": "横浜市 西区",
        "dongs": [
          "みなとみらい",
          "高島",
          "南幸",
          "北幸",
          "平沼"
        ]
      },
      {
        "name": "横浜市 港北区",
        "dongs": [
          "新横浜",
          "菊名",
          "綱島",
          "日吉",
          "大倉山"
        ]
      },
      {
        "name": "横浜市 青葉区",
        "dongs": [
          "たまプラーザ",
          "青葉台",
          "美しが丘",
          "市が尾"
        ]
      },
      {
        "name": "横浜市 鶴見区",
        "dongs": [
          "鶴見中央",
          "生麦",
          "矢向",
          "潮田"
        ]
      },
      {
        "name": "川崎市 川崎区",
        "dongs": [
          "川崎駅前",
          "砂子",
          "駅前本町",
          "富士見"
        ]
      },
      {
        "name": "川崎市 中原区",
        "dongs": [
          "武蔵小杉",
          "新丸子",
          "木月",
          "等々力"
        ]
      },
      {
        "name": "鎌倉市",
        "dongs": [
          "小町",
          "雪ノ下",
          "由比ガ浜",
          "長谷",
          "大船"
        ]
      },
      {
        "name": "藤沢市",
        "dongs": [
          "藤沢",
          "鵠沼",
          "江の島",
          "辻堂"
        ]
      }
    ]
  },
  {
    "name": "愛知県",
    "shortName": "愛知",
    "gunguList": [
      {
        "name": "名古屋市 中区",
        "dongs": [
          "栄",
          "錦",
          "大須",
          "丸の内",
          "新栄"
        ]
      },
      {
        "name": "名古屋市 中村区",
        "dongs": [
          "名駅",
          "名駅南",
          "太閤",
          "則武"
        ]
      },
      {
        "name": "名古屋市 東区",
        "dongs": [
          "泉",
          "東桜",
          "葵",
          "徳川"
        ]
      },
      {
        "name": "名古屋市 千種区",
        "dongs": [
          "今池",
          "星が丘",
          "覚王山",
          "本山"
        ]
      },
      {
        "name": "豊田市",
        "dongs": [
          "西町",
          "喜多町",
          "若宮町",
          "トヨタ町"
        ]
      },
      {
        "name": "岡崎市",
        "dongs": [
          "康生通",
          "明大寺町",
          "羽根町"
        ]
      }
    ]
  },
  {
    "name": "福岡県",
    "shortName": "福岡",
    "gunguList": [
      {
        "name": "福岡市 博多区",
        "dongs": [
          "博多駅前",
          "中洲",
          "住吉",
          "祇園町",
          "空港前"
        ]
      },
      {
        "name": "福岡市 中央区",
        "dongs": [
          "天神",
          "大名",
          "今泉",
          "薬院",
          "警固",
          "西公園"
        ]
      },
      {
        "name": "福岡市 東区",
        "dongs": [
          "香椎",
          "千早",
          "箱崎",
          "照葉"
        ]
      },
      {
        "name": "北九州市 小倉北区",
        "dongs": [
          "京町",
          "魚町",
          "鍛冶町",
          "室町"
        ]
      },
      {
        "name": "久留米市",
        "dongs": [
          "東町",
          "日吉町",
          "六ツ門町"
        ]
      }
    ]
  },
  {
    "name": "北海道",
    "shortName": "北海道",
    "gunguList": [
      {
        "name": "札幌市 中央区",
        "dongs": [
          "大通",
          "すすきの",
          "北一条",
          "南二条",
          "円山"
        ]
      },
      {
        "name": "札幌市 北区",
        "dongs": [
          "北二十四条",
          "麻生",
          "屯田",
          "新琴似"
        ]
      },
      {
        "name": "函館市",
        "dongs": [
          "若松町",
          "元町",
          "五稜郭町",
          "湯川町"
        ]
      },
      {
        "name": "旭川市",
        "dongs": [
          "宮下通",
          "一条通",
          "二条通",
          "買物公園"
        ]
      }
    ]
  },
  {
    "name": "埼玉県",
    "shortName": "埼玉",
    "gunguList": [
      {
        "name": "さいたま市 大宮区",
        "dongs": [
          "大門町",
          "桜木町",
          "仲町",
          "錦町"
        ]
      },
      {
        "name": "さいたま市 浦和区",
        "dongs": [
          "高砂",
          "仲町",
          "東高砂町",
          "常盤"
        ]
      },
      {
        "name": "川越市",
        "dongs": [
          "脇田町",
          "新富町",
          "幸町",
          "元町"
        ]
      },
      {
        "name": "川口市",
        "dongs": [
          "栄町",
          "本町",
          "並木",
          "西川口"
        ]
      }
    ]
  },
  {
    "name": "千葉県",
    "shortName": "千葉",
    "gunguList": [
      {
        "name": "千葉市 中央区",
        "dongs": [
          "富士見",
          "新町",
          "中央",
          "本千葉町"
        ]
      },
      {
        "name": "船橋市",
        "dongs": [
          "本町",
          "湊町",
          "西船",
          "前原西"
        ]
      },
      {
        "name": "浦安市",
        "dongs": [
          "舞浜",
          "美浜",
          "入船",
          "明海"
        ]
      },
      {
        "name": "柏市",
        "dongs": [
          "柏",
          "末広町",
          "若柴",
          "豊四季"
        ]
      }
    ]
  },
  {
    "name": "兵庫県",
    "shortName": "兵庫",
    "gunguList": [
      {
        "name": "神戸市 中央区",
        "dongs": [
          "三宮町",
          "北野町",
          "ハーバーランド",
          "元町通",
          "磯上通"
        ]
      },
      {
        "name": "神戸市 灘区",
        "dongs": [
          "六甲道",
          "水道筋",
          "王子町",
          "弓木町"
        ]
      },
      {
        "name": "姫路市",
        "dongs": [
          "駅前町",
          "二階町",
          "御幸通",
          "本町"
        ]
      },
      {
        "name": "西宮市",
        "dongs": [
          "甲子園",
          "西宮北口",
          "夙川",
          "苦楽園"
        ]
      }
    ]
  },
  {
    "name": "宮城県",
    "shortName": "宮城",
    "gunguList": [
      {
        "name": "仙台市 青葉区",
        "dongs": [
          "一番町",
          "中央",
          "国分町",
          "本町"
        ]
      },
      {
        "name": "仙台市 宮城野区",
        "dongs": [
          "榴岡",
          "宮城野",
          "苦竹"
        ]
      }
    ]
  },
  {
    "name": "広島県",
    "shortName": "広島",
    "gunguList": [
      {
        "name": "広島市 中区",
        "dongs": [
          "八丁堀",
          "紙屋町",
          "本通",
          "流川町"
        ]
      },
      {
        "name": "広島市 南区",
        "dongs": [
          "松原町",
          "皆実町",
          "宇品"
        ]
      },
      {
        "name": "福山市",
        "dongs": [
          "三之丸町",
          "伏見町",
          "元町"
        ]
      }
    ]
  },
  {
    "name": "静岡県",
    "shortName": "静岡",
    "gunguList": [
      {
        "name": "静岡市 葵区",
        "dongs": [
          "紺屋町",
          "呉服町",
          "追手町",
          "鷹匠"
        ]
      },
      {
        "name": "浜松市 中央区",
        "dongs": [
          "鍛冶町",
          "砂山町",
          "板屋町",
          "旭町"
        ]
      }
    ]
  },
  {
    "name": "沖縄県",
    "shortName": "沖縄",
    "gunguList": [
      {
        "name": "那覇市",
        "dongs": [
          "国際通り",
          "久茂地",
          "牧志",
          "おもろまち",
          "松山"
        ]
      },
      {
        "name": "沖縄市",
        "dongs": [
          "中央",
          "胡屋",
          "上地",
          "諸見里"
        ]
      }
    ]
  }
];
