import { type SidoData } from "./regions";

export const taiwanRegions: SidoData[] = [
  {
    "name": "臺北市",
    "shortName": "臺北",
    "gunguList": [
      {
        "name": "大安區",
        "dongs": [
          "敦化南路",
          "忠孝東路",
          "信義路",
          "和平東路",
          "永康街",
          "師大",
          "臺大周邊"
        ]
      },
      {
        "name": "信義區",
        "dongs": [
          "臺北101",
          "市府轉運站",
          "松山高中周邊",
          "吳興街",
          "松德路",
          "象山"
        ]
      },
      {
        "name": "中山區",
        "dongs": [
          "南京西路",
          "林森北路",
          "民生東路",
          "大直",
          "晴光市場",
          "行天宮"
        ]
      },
      {
        "name": "中正區",
        "dongs": [
          "臺北車站",
          "重慶南路",
          "羅斯福路",
          "公館",
          "古亭",
          "植物園"
        ]
      },
      {
        "name": "松山區",
        "dongs": [
          "松山機場",
          "民生社區",
          "饒河夜市",
          "八德路",
          "南京東路"
        ]
      },
      {
        "name": "內湖區",
        "dongs": [
          "內湖科技園區",
          "西湖",
          "港墘",
          "東湖",
          "大湖公園"
        ]
      },
      {
        "name": "士林區",
        "dongs": [
          "士林夜市",
          "天母",
          "劍潭",
          "故宮",
          "陽明山"
        ]
      },
      {
        "name": "北投區",
        "dongs": [
          "新北投溫泉",
          "石牌",
          "明德",
          "關渡"
        ]
      },
      {
        "name": "萬華區",
        "dongs": [
          "西門町",
          "龍山寺",
          "青年公園",
          "艋舺"
        ]
      },
      {
        "name": "南港區",
        "dongs": [
          "南港軟體園區",
          "南港展覽館",
          "中信金融園區"
        ]
      },
      {
        "name": "文山區",
        "dongs": [
          "木柵(動物園)",
          "景美",
          "政大周邊"
        ]
      },
      {
        "name": "大同區",
        "dongs": [
          "大稻埕(迪化街)",
          "圓山",
          "雙連",
          "延三夜市"
        ]
      }
    ]
  },
  {
    "name": "新北市",
    "shortName": "新北",
    "gunguList": [
      {
        "name": "板橋區",
        "dongs": [
          "新板特區(新北市府)",
          "府中",
          "新埔",
          "江子翠",
          "亞東醫院"
        ]
      },
      {
        "name": "中和區",
        "dongs": [
          "南勢角(緬甸街)",
          "景安",
          "遠東世紀廣場",
          "積穗"
        ]
      },
      {
        "name": "永和區",
        "dongs": [
          "頂溪",
          "樂华夜市",
          "四號公園",
          "秀朗國小"
        ]
      },
      {
        "name": "新莊區",
        "dongs": [
          "新莊副都心",
          "頭前重劃區",
          "輔大周邊",
          "丹鳳"
        ]
      },
      {
        "name": "三重區",
        "dongs": [
          "台北橋",
          "菜寮",
          "三和夜市",
          "徐匯中學"
        ]
      },
      {
        "name": "新店區",
        "dongs": [
          "新店區公所",
          "碧潭",
          "七張",
          "大坪林",
          "安坑"
        ]
      },
      {
        "name": "土城區",
        "dongs": [
          "頂埔科技園區",
          "海山",
          "土城重劃區"
        ]
      },
      {
        "name": "汐止區",
        "dongs": [
          "汐科站",
          "東方科學園區",
          "遠雄U-Town",
          "金龍湖"
        ]
      },
      {
        "name": "淡水區",
        "dongs": [
          "淡水老街",
          "紅毛城",
          "漁人碼頭",
          "淡海新市鎮"
        ]
      },
      {
        "name": "林口區",
        "dongs": [
          "三井Outlet",
          "長庚生活圈",
          "林口新市鎮"
        ]
      }
    ]
  },
  {
    "name": "桃園市",
    "shortName": "桃園",
    "gunguList": [
      {
        "name": "桃園區",
        "dongs": [
          "桃園火車站",
          "藝文特區",
          "中路重劃區",
          "經國重劃區"
        ]
      },
      {
        "name": "中壢區",
        "dongs": [
          "中壢車站",
          "中壢夜市",
          "高鐵桃園站(青埔)",
          "中原大學生活圈"
        ]
      },
      {
        "name": "龜山區",
        "dongs": [
          "林口長庚醫院",
          "華亞科技園區",
          "A7重劃區"
        ]
      },
      {
        "name": "蘆竹區",
        "dongs": [
          "南崁",
          "大竹",
          "山腳"
        ]
      },
      {
        "name": "大園區",
        "dongs": [
          "桃園國際機場",
          "航空城",
          "大園市區"
        ]
      },
      {
        "name": "八德區",
        "dongs": [
          "八德擴大重劃區",
          "大湳",
          "廣丰新天地"
        ]
      },
      {
        "name": "平鎮區",
        "dongs": [
          "平鎮市區",
          "山仔頂",
          "南勢"
        ]
      }
    ]
  },
  {
    "name": "臺中市",
    "shortName": "臺中",
    "gunguList": [
      {
        "name": "西屯區",
        "dongs": [
          "七期重劃區(臺中市政府)",
          "逢甲商圈",
          "臺中國家歌劇院",
          "中科園區"
        ]
      },
      {
        "name": "北屯區",
        "dongs": [
          "水湳經貿園區",
          "捷運總站",
          "十四期重劃區",
          "大坑"
        ]
      },
      {
        "name": "南屯區",
        "dongs": [
          "文心森林公園",
          "豐樂雕塑公園",
          "嶺東科技大學周邊"
        ]
      },
      {
        "name": "西區",
        "dongs": [
          "勤美草悟道",
          "國立臺灣美術館",
          "審計新村",
          "公益路商圈"
        ]
      },
      {
        "name": "北區",
        "dongs": [
          "一中商圈",
          "中國醫藥大學生活圈",
          "臺中公園"
        ]
      },
      {
        "name": "中區",
        "dongs": [
          "臺中火車站",
          "宮原眼科周邊",
          "第二市場"
        ]
      }
    ]
  },
  {
    "name": "高雄市",
    "shortName": "高雄",
    "gunguList": [
      {
        "name": "左營區",
        "dongs": [
          "高鐵左營站",
          "蓮池潭",
          "漢神巨蛋商圈",
          "果貿社區"
        ]
      },
      {
        "name": "鼓山區",
        "dongs": [
          "美術館特區",
          "農十六重劃區",
          "駁二藝術特區",
          "西子灣"
        ]
      },
      {
        "name": "苓雅區",
        "dongs": [
          "高雄市政府四維行政中心",
          "文化中心",
          "三多商圈",
          "85大樓周邊"
        ]
      },
      {
        "name": "新興區",
        "dongs": [
          "美麗島站(光之穹頂)",
          "六合夜市",
          "新堀江商圈"
        ]
      },
      {
        "name": "三民區",
        "dongs": [
          "高雄火車站",
          "後驛商圈",
          "高醫生活圈",
          "河堤社區"
        ]
      },
      {
        "name": "前金區",
        "dongs": [
          "中央公園",
          "愛河周邊",
          "漢神百貨本館"
        ]
      },
      {
        "name": "鳳山區",
        "dongs": [
          "衛武營國家藝術文化中心",
          "鳳山火車站",
          "大东藝術文化中心"
        ]
      }
    ]
  },
  {
    "name": "臺南市",
    "shortName": "臺南",
    "gunguList": [
      {
        "name": "中西區",
        "dongs": [
          "赤崁樓",
          "孔廟",
          "國華街商圈",
          "神農街",
          "海安路"
        ]
      },
      {
        "name": "東區",
        "dongs": [
          "成功大學周邊",
          "南紡購物中心",
          "臺南火車站後站"
        ]
      },
      {
        "name": "安平區",
        "dongs": [
          "安平老街",
          "安平古堡",
          "安平漁港",
          "臺南市政府永華市政中心"
        ]
      },
      {
        "name": "永康區",
        "dongs": [
          "大橋",
          "南臺科技大學周邊",
          "永康工業區"
        ]
      },
      {
        "name": "善化區",
        "dongs": [
          "南部科學園區(南科)",
          "善化火車站",
          "善化啤酒廠周邊"
        ]
      }
    ]
  },
  {
    "name": "新竹市",
    "shortName": "新竹",
    "gunguList": [
      {
        "name": "東區",
        "dongs": [
          "新竹科學園區(竹科)",
          "清華大學",
          "陽明交通大學",
          "新竹巨城"
        ]
      },
      {
        "name": "北區",
        "dongs": [
          "新竹城隍廟",
          "湳雅大魯閣",
          "南寮漁港"
        ]
      },
      {
        "name": "香山區",
        "dongs": [
          "香山濕地",
          "中華大學生活圈",
          "頂埔"
        ]
      }
    ]
  },
  {
    "name": "新竹縣",
    "shortName": "竹縣",
    "gunguList": [
      {
        "name": "竹北市",
        "dongs": [
          "高鐵新竹站(六家)",
          "縣政府周邊",
          "遠百竹北店",
          "生醫園區"
        ]
      },
      {
        "name": "竹東鎮",
        "dongs": [
          "工研院周邊",
          "竹東車站",
          "二重埔"
        ]
      }
    ]
  },
  {
    "name": "基隆市",
    "shortName": "基隆",
    "gunguList": [
      {
        "name": "仁愛區",
        "dongs": [
          "基隆廟口夜市",
          "基隆火車站",
          "海洋廣場"
        ]
      },
      {
        "name": "中正區",
        "dongs": [
          "正濱漁港",
          "和平島公園",
          "國立海洋科技博物館"
        ]
      }
    ]
  },
  {
    "name": "嘉義市",
    "shortName": "嘉義",
    "gunguList": [
      {
        "name": "東區",
        "dongs": [
          "檜意森活村",
          "文化路夜市",
          "嘉義公園"
        ]
      },
      {
        "name": "西區",
        "dongs": [
          "嘉義火車站",
          "家樂福商圈",
          "高鐵接駁站"
        ]
      }
    ]
  },
  {
    "name": "宜蘭縣",
    "shortName": "宜蘭",
    "gunguList": [
      {
        "name": "礁溪鄉",
        "dongs": [
          "礁溪溫泉公園",
          "湯圍溝",
          "礁溪轉運站"
        ]
      },
      {
        "name": "羅東鎮",
        "dongs": [
          "羅東夜市",
          "羅東林業文化園區",
          "羅東運動公園"
        ]
      },
      {
        "name": "宜蘭市",
        "dongs": [
          "宜蘭火車站(幾米廣場)",
          "新月廣場",
          "宜蘭大學生活圈"
        ]
      }
    ]
  },
  {
    "name": "花蓮縣",
    "shortName": "花蓮",
    "gunguList": [
      {
        "name": "花蓮市",
        "dongs": [
          "花蓮車站",
          "東大門夜市",
          "七星潭周邊",
          "中正路商圈"
        ]
      },
      {
        "name": "吉安鄉",
        "dongs": [
          "慶修院",
          "吉安火車站",
          "貨櫃星巴克周邊"
        ]
      }
    ]
  }
];
